InformationRegisters/НалогообложениеНачислений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>НалогообложениеНачислений</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВидДохода</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДоходов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособОбложенияИПН</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыНалогообложенияДоходов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДоходНеПодлежащийНалогообложениюИПН</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоходыНеПодлежащиеНалогообложениюЧастично</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособОбложенияОПВ</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыНалогообложенияДоходов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДоходНеПодлежащийНалогообложениюОПВ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоходыНеПодлежащиеНалогообложениюЧастично</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособОбложенияСН</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыНалогообложенияДоходов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДоходНеПодлежащийНалогообложениюСН</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоходыНеПодлежащиеНалогообложениюЧастично</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособОбложенияСО</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыНалогообложенияДоходов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДоходНеПодлежащийНалогообложениюСО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоходыНеПодлежащиеНалогообложениюЧастично</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособОбложенияОППВ</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыНалогообложенияДоходов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДоходНеПодлежащийНалогообложениюОППВ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоходыНеПодлежащиеНалогообложениюЧастично</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособОбложенияВОСМС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыНалогообложенияДоходов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДоходНеПодлежащийНалогообложениюВОСМС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоходыНеПодлежащиеНалогообложениюЧастично</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособОбложенияООСМС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыНалогообложенияДоходов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДоходНеПодлежащийНалогообложениюООСМС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоходыНеПодлежащиеНалогообложениюЧастично</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособОбложенияЕП</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыНалогообложенияДоходов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДоходНеПодлежащийНалогообложениюЕП</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоходыНеПодлежащиеНалогообложениюЧастично</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособОбложенияОПВР</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыНалогообложенияДоходов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДоходНеПодлежащийНалогообложениюОПВР</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоходыНеПодлежащиеНалогообложениюЧастично</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Начисление</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДивидендов</v8:Type>
						<v8:Type>cfg:CatalogRef.ВидыВыплатБывшимСотрудникам</v8:Type>
						<v8:Type>cfg:CatalogRef.ВидыПрочихДоходовФизическихЛиц</v8:Type>
						<v8:Type>cfg:ChartOfCalculationTypesRef.Начисления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СпособыНалогообложенияДоходов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>СпособыНалогообложенияДоходов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОблагаетсяЦеликом</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеОблагаетсяЦеликом</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеОблагаетсяЧастично</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/КатегорииНачисленийИНеоплаченногоВремени.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>КатегорииНачисленийИНеоплаченногоВремени</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПовременнаяОплатаТруда</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СдельнаяОплатаТруда</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаТрудаВНатуральнойФорме</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоходВНатуральнойФорме</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КомпенсационныеВыплаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Премия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КвартальнаяПремия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РайонныйКоэффициент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СевернаяНадбавка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УправленческийУчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДенежноеДовольствиеКомпенсацияОтпуска</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДенежноеСодержаниеКомпенсацияОтпуска</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДенежноеСодержаниеНаПериодКомандировки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДенежноеСодержаниеНаПериодОтпуска</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДенежноеСодержаниеНаПериодОтпускаНаСанаторноКурортноеЛечение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДенежноеСодержаниеОплатаДнейУходаЗаДетьмиИнвалидами</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаОтпуска</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КомпенсацияОтпуска</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЕдиновременнаяВыплатаКОтпускуГосслужащего</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЕдиновременнаяВыплатаКОтпуску</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МатериальнаяПомощьПриОтпускеГосслужащего</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МатериальнаяПомощьПриОтпуске</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтпускПоБеременностиИРодам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеявкаПоБолезни</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеявкаПоНевыясненнымПричинам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прогул</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПростойПоВинеРаботника</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаПростояПоВинеРаботодателя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаПростояПоНезависящимОтРаботодателяПричинам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаБольничногоЛиста</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СохраняемоеДенежноеСодержание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаПоСреднемуЗаработку</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоплатаДоСреднегоЗаработка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаСверхурочныхВоеннослужащим</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтпускПоБеременностиИРодамВоеннослужащего</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаБольничногоЛистаЗаСчетРаботодателя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаБольничногоПрофзаболевание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаБольничногоНесчастныйСлучайНаПроизводстве</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаКомандировки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоплатаДоСреднегоЗаработкаЗаДниБолезни</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаДнейУходаЗаДетьмиИнвалидами</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПособиеПоУходуЗаРебенкомДоПолутораЛетВоеннослужащим</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПособиеПоУходуЗаРебенкомДоПолутораЛет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПособиеПоУходуЗаРебенкомДоТрехЛет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыходноеПособиеМесячноеДенежноеСодержание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыходноеПособие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоплатаЗаСовмещение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БолезньБезОплаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтпускПоБеременностиИРодамБезОплаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаработокНаВремяТрудоустройства</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КомпенсацияЗаЗадержкуЗарплаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МатериальнаяПомощь</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаПоДоговорамПодряда</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Льгота</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыбираемаяСотрудникомЛьгота</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НадбавкаЗаВредность</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтпускНаСанаторноКурортноеЛечение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отгул</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаПредыдущимиДокументами</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтпускБезОплаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоплатаДоДенежногоСодержанияЗаДниБолезни</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КомпенсацияЗаНеотработанныеДниЧасыПриУвольнении</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КомпенсацияЗаНеотработанныеДниПриУвольненииГосслужащего</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоначислениеДоУправленческогоУчета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КомпенсацияМоральногоВреда</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СохраняемоеДенежноеДовольствие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МатериальнаяПомощьПриОтпускеВоеннослужащего</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоплатаКомандировки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДенежноеСодержаниеДоплатаКомандировки</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

InformationRegisters/НалогообложениеНачислений/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область СлужебныеПроцедурыИФункции

Процедура СоздатьНалогообложениеНачисленийПоНастройкам(Начисления = Неопределено) Экспорт
	
	ВидДохода 			= ПредопределенноеЗначение("Справочник.ВидыДоходов.ДоходыОтРаботодателя"); 
	Облагается 			= ПредопределенноеЗначение("Перечисление.СпособыНалогообложенияДоходов.ОблагаетсяЦеликом");
	НеОблагается 		= ПредопределенноеЗначение("Перечисление.СпособыНалогообложенияДоходов.НеОблагаетсяЦеликом");
	НеОблагаетсяЧатично = ПредопределенноеЗначение("Перечисление.СпособыНалогообложенияДоходов.НеОблагаетсяЧастично");
	ИспользуетсяЕП 		= Истина;
	
	ДоходНеПодлежащийНалогообложениюМатериальнаяПомощь = НСтр("ru = 'Пп. 18 п. 1) ст. 156 (выплаты для оплаты медицинских услуг, при рождении ребенка, на погребение)'"); 
	ДоходНеПодлежащийНалогообложению = Справочники.ДоходыНеПодлежащиеНалогообложениюЧастично.НайтиПоНаименованию(ДоходНеПодлежащийНалогообложениюМатериальнаяПомощь);
	
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Начисления.Ссылка КАК Начисление,
	|	Начисления.Наименование,
	|	Начисления.ВидОтпуска,
	|	Начисления.КатегорияНачисленияИлиНеоплаченногоВремени
	|ИЗ
	|	ПланВидовРасчета.Начисления КАК Начисления";
	
	Если Начисления <> Неопределено Тогда
		Запрос.Текст = Запрос.Текст + "
		|ГДЕ
		|	Начисления.Ссылка В (&Начисления)";
		
		Запрос.Параметры.Вставить("Начисления", Начисления);
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если Выборка.КатегорияНачисленияИлиНеоплаченногоВремени = Перечисления.КатегорииНачисленийИНеоплаченногоВремени.ОтпускПоБеременностиИРодамБезОплаты
			ИЛИ Выборка.КатегорияНачисленияИлиНеоплаченногоВремени = Перечисления.КатегорииНачисленийИНеоплаченногоВремени.ПособиеПоУходуЗаРебенкомДоТрехЛет
			ИЛИ Выборка.КатегорияНачисленияИлиНеоплаченногоВремени = Перечисления.КатегорииНачисленийИНеоплаченногоВремени.Прогул                                   
			ИЛИ Выборка.КатегорияНачисленияИлиНеоплаченногоВремени = Перечисления.КатегорииНачисленийИНеоплаченногоВремени.НеявкаПоНевыясненнымПричинам
			ИЛИ Выборка.КатегорияНачисленияИлиНеоплаченногоВремени = Перечисления.КатегорииНачисленийИНеоплаченногоВремени.ОтпускБезОплаты
			ИЛИ Выборка.КатегорияНачисленияИлиНеоплаченногоВремени = Перечисления.КатегорииНачисленийИНеоплаченногоВремени.Отгул
			ИЛИ Выборка.КатегорияНачисленияИлиНеоплаченногоВремени = Перечисления.КатегорииНачисленийИНеоплаченногоВремени.ПростойПоВинеРаботника 
			ИЛИ Выборка.КатегорияНачисленияИлиНеоплаченногоВремени = Перечисления.КатегорииНачисленийИНеоплаченногоВремени.ОплатаПредыдущимиДокументами	Тогда
			
			ДобавитьСведенияОНалогообложениеНачислений(Выборка.Начисление, ВидДохода, '19000101', НеОблагается, НеОблагается, НеОблагается, НеОблагается, НеОблагается, Неопределено, Неопределено);
			
			// Отчисления на ОСМС за счет работодателя вводятся с 1 июля 2017 г
			ДобавитьСведенияОНалогообложениеНачислений(Выборка.Начисление, ВидДохода, '20170701', НеОблагается, НеОблагается, НеОблагается, НеОблагается, НеОблагается, Неопределено, НеОблагается);
			
			// Отчисления на ОСМС за счет работодателя вводятся с 1 января 2019 г
			ДобавитьСведенияОНалогообложениеНачислений(Выборка.Начисление, ВидДохода, '20190101', НеОблагается, НеОблагается, НеОблагается, НеОблагается, НеОблагается, НеОблагается, НеОблагается);
			
			Если ИспользуетсяЕП Тогда
				// ЕП вводятся с 1 января 2023 г
				ДобавитьСведенияОНалогообложениеНачислений(Выборка.Начисление, ВидДохода, '20230101', НеОблагается, НеОблагается, НеОблагается, НеОблагается, НеОблагается, НеОблагается, НеОблагается,,,,,,,, Облагается);
			КонецЕсли;
			
			// ОПВР вводятся с 1 января 2024 г
			ДобавитьСведенияОНалогообложениеНачислений(Выборка.Начисление, ВидДохода, '20240101', НеОблагается, НеОблагается, НеОблагается, НеОблагается, НеОблагается, НеОблагается, НеОблагается, НеОблагается,,,,,,, НеОблагается,, НеОблагается);

		ИначеЕсли Выборка.КатегорияНачисленияИлиНеоплаченногоВремени = Перечисления.КатегорииНачисленийИНеоплаченногоВремени.КомпенсацияОтпуска
			ИЛИ Выборка.КатегорияНачисленияИлиНеоплаченногоВремени = Перечисления.КатегорииНачисленийИНеоплаченногоВремени.ВыходноеПособие Тогда 
			
			ДобавитьСведенияОНалогообложениеНачислений(Выборка.Начисление,ВидДохода,'19000101',Облагается,НеОблагается,НеОблагается,НеОблагается,НеОблагается, Неопределено, Неопределено);
			
			// Отчисления на ОСМС за счет работодателя вводятся с 1 июля 2017 г
			ДобавитьСведенияОНалогообложениеНачислений(Выборка.Начисление,ВидДохода,'20170701',Облагается,НеОблагается,НеОблагается,НеОблагается,НеОблагается, Неопределено, Облагается);
			
			// Отчисления на ОСМС за счет работодателя вводятся с 1 января 2018 г
			ДобавитьСведенияОНалогообложениеНачислений(Выборка.Начисление,ВидДохода,'20180101', Облагается, Облагается, Облагается, Облагается, Облагается, Облагается, Облагается);
			
			// Отчисления на ОСМС за счет работодателя вводятся с 1 января 2019 г
			ДобавитьСведенияОНалогообложениеНачислений(Выборка.Начисление,ВидДохода,'20190101', Облагается, Облагается, Облагается, Облагается, Облагается, Облагается, Облагается);
			
			Если ИспользуетсяЕП Тогда
				// ЕП вводятся с 1 января 2023 г
				ДобавитьСведенияОНалогообложениеНачислений(Выборка.Начисление,ВидДохода,'20230101', Облагается, Облагается, Облагается, Облагается, Облагается, Облагается, Облагается,,,,,,,, Облагается);
			КонецЕсли;
			
			// ОПВР вводятся с 1 января 2024 г
			ДобавитьСведенияОНалогообложениеНачислений(Выборка.Начисление, ВидДохода, '20240101', Облагается, Облагается, Облагается, Облагается, Облагается, Облагается, Облагается,,,,,,,, Облагается,, Облагается);
			
		ИначеЕсли Выборка.КатегорияНачисленияИлиНеоплаченногоВремени = Перечисления.КатегорииНачисленийИНеоплаченногоВремени.ОплатаПоДоговорамПодряда Тогда 
			
			ДобавитьСведенияОНалогообложениеНачислений(Выборка.Начисление,
						ПредопределенноеЗначение("Справочник.ВидыДоходов.ДоходыОтНалоговогоАгента"),
						'19000101',
						Облагается,НеОблагается,Неопределено,Неопределено,Неопределено, Неопределено, Неопределено);

			// Взносы на ОСМС по доховорам ГПХ вводятся с 1 июля 2017 г
			ДобавитьСведенияОНалогообложениеНачислений(Выборка.Начисление,
						ПредопределенноеЗначение("Справочник.ВидыДоходов.ДоходыОтНалоговогоАгента"),
						'20170701',
						Облагается,НеОблагается,Неопределено,Неопределено,Неопределено, Неопределено, Неопределено);
						
			// Взносы на ОСМС по доховорам ГПХ отменены с 1 января 2018 г
			ДобавитьСведенияОНалогообложениеНачислений(Выборка.Начисление,
						ПредопределенноеЗначение("Справочник.ВидыДоходов.ДоходыОтНалоговогоАгента"),
						'20180101',
						Облагается,НеОблагается,Неопределено,Неопределено,Неопределено, Неопределено, Неопределено);
			
			// Взносы на ОСМС по доховорам ГПХ отменены с 1 января 2019 г
			ДобавитьСведенияОНалогообложениеНачислений(Выборка.Начисление,
						ПредопределенноеЗначение("Справочник.ВидыДоходов.ДоходыОтНалоговогоАгента"),
						'20190101',
						Облагается,Облагается,Неопределено,Неопределено,Неопределено, Неопределено, Неопределено);
			
			// Взносы на ОСМС по доховорам ГПХ отменены с 1 января 2020 г
			ДобавитьСведенияОНалогообложениеНачислений(Выборка.Начисление,
						ПредопределенноеЗначение("Справочник.ВидыДоходов.ДоходыОтНалоговогоАгента"),
						'20200101',
						Облагается,Облагается,,Неопределено,Неопределено, Облагается, Неопределено);
			
			// СО по доховорам ГПХ отменены с 1 января 2025 г
			ДобавитьСведенияОНалогообложениеНачислений(Выборка.Начисление,
						ПредопределенноеЗначение("Справочник.ВидыДоходов.ДоходыОтНалоговогоАгента"),
						'20250101',
						Облагается,Облагается,,Облагается,Неопределено, Облагается, Неопределено);
			
		ИначеЕсли Выборка.КатегорияНачисленияИлиНеоплаченногоВремени = Перечисления.КатегорииНачисленийИНеоплаченногоВремени.МатериальнаяПомощь Тогда
			
			ДобавитьСведенияОНалогообложениеНачислений(Выборка.Начисление,ВидДохода,'19000101',НеОблагаетсяЧатично,НеОблагаетсяЧатично,НеОблагаетсяЧатично,НеОблагаетсяЧатично,НеОблагаетсяЧатично, Неопределено, Неопределено,
														ДоходНеПодлежащийНалогообложению,ДоходНеПодлежащийНалогообложению,ДоходНеПодлежащийНалогообложению, ДоходНеПодлежащийНалогообложению,ДоходНеПодлежащийНалогообложению);
														
			// Отчисления на ОСМС за счет работодателя вводятся с 1 июля 2017 г
			ДобавитьСведенияОНалогообложениеНачислений(Выборка.Начисление,ВидДохода,'20170701',НеОблагаетсяЧатично,НеОблагаетсяЧатично,НеОблагаетсяЧатично,НеОблагаетсяЧатично,НеОблагаетсяЧатично, Неопределено, НеОблагаетсяЧатично,
														ДоходНеПодлежащийНалогообложению,ДоходНеПодлежащийНалогообложению,ДоходНеПодлежащийНалогообложению, ДоходНеПодлежащийНалогообложению,ДоходНеПодлежащийНалогообложению, Неопределено, ДоходНеПодлежащийНалогообложению);
														
			// Отчисления на ОСМС за счет работодателя вводятся с 1 января 2019 г
			ДобавитьСведенияОНалогообложениеНачислений(Выборка.Начисление,ВидДохода,'20190101',НеОблагаетсяЧатично,НеОблагаетсяЧатично,НеОблагаетсяЧатично,НеОблагаетсяЧатично,НеОблагаетсяЧатично, НеОблагаетсяЧатично, НеОблагаетсяЧатично,
														ДоходНеПодлежащийНалогообложению,ДоходНеПодлежащийНалогообложению,ДоходНеПодлежащийНалогообложению, ДоходНеПодлежащийНалогообложению,ДоходНеПодлежащийНалогообложению, ДоходНеПодлежащийНалогообложению, ДоходНеПодлежащийНалогообложению);
														
			Если ИспользуетсяЕП Тогда
				// ЕП вводятся с 1 января 2023 г
				ДобавитьСведенияОНалогообложениеНачислений(Выборка.Начисление,ВидДохода,'20230101',НеОблагаетсяЧатично,НеОблагаетсяЧатично,НеОблагаетсяЧатично,НеОблагаетсяЧатично,НеОблагаетсяЧатично, НеОблагаетсяЧатично, НеОблагаетсяЧатично,
															ДоходНеПодлежащийНалогообложению,ДоходНеПодлежащийНалогообложению,ДоходНеПодлежащийНалогообложению, ДоходНеПодлежащийНалогообложению,ДоходНеПодлежащийНалогообложению, ДоходНеПодлежащийНалогообложению, ДоходНеПодлежащийНалогообложению, Облагается);
			КонецЕсли;
			
			// ОПВР вводятся с 1 января 2024 г
			ДобавитьСведенияОНалогообложениеНачислений(Выборка.Начисление, ВидДохода, '20240101',НеОблагаетсяЧатично,НеОблагаетсяЧатично,НеОблагаетсяЧатично,НеОблагаетсяЧатично,НеОблагаетсяЧатично, НеОблагаетсяЧатично, НеОблагаетсяЧатично,
														ДоходНеПодлежащийНалогообложению,ДоходНеПодлежащийНалогообложению,ДоходНеПодлежащийНалогообложению, ДоходНеПодлежащийНалогообложению,ДоходНеПодлежащийНалогообложению, ДоходНеПодлежащийНалогообложению, ДоходНеПодлежащийНалогообложению, Облагается,, НеОблагаетсяЧатично, ДоходНеПодлежащийНалогообложению);
			
		ИначеЕсли Выборка.КатегорияНачисленияИлиНеоплаченногоВремени = Перечисления.КатегорииНачисленийИНеоплаченногоВремени.ОплатаОтпуска 
			И ЗначениеЗаполнено(Выборка.ВидОтпуска)
			И (Выборка.ВидОтпуска = ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ВидыОтпусков.ОтпускДляПрохожденияСкрининговыхИсследований")
				ИЛИ Выборка.ВидОтпуска = ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ВидыОтпусков.ОтпускНаПостановкуНаМедицинскийУчетПоБеременностиДоДвенадцатиНедель")) Тогда
														
			ДобавитьСведенияОНалогообложениеНачислений(Выборка.Начисление, ВидДохода, '20200701', Облагается, Облагается, Облагается, Облагается, Облагается, Облагается, Облагается);
			
			Если ИспользуетсяЕП Тогда
				// ЕП вводятся с 1 января 2023 г
				ДобавитьСведенияОНалогообложениеНачислений(Выборка.Начисление, ВидДохода, '20230101', Облагается, Облагается, Облагается, Облагается, Облагается, Облагается, Облагается,,,,,,,, Облагается);
			КонецЕсли;
			
			// ОПВР вводятся с 1 января 2024 г
			ДобавитьСведенияОНалогообложениеНачислений(Выборка.Начисление, ВидДохода, '20240101', Облагается, Облагается, Облагается, Облагается, Облагается, Облагается, Облагается,,,,,,,, Облагается,, Облагается);
			
		Иначе
			
			ДобавитьСведенияОНалогообложениеНачислений(Выборка.Начисление,ВидДохода,'19000101',Облагается,Облагается,Облагается,Облагается,Облагается, Неопределено, Неопределено);
			
			// Отчисления на ОСМС за счет работодателя вводятся с 1 июля 2017 г
			ДобавитьСведенияОНалогообложениеНачислений(Выборка.Начисление,ВидДохода,'20170701',Облагается,Облагается,Облагается,Облагается,Облагается, Неопределено, Облагается);
			
			// Отчисления на ОСМС за счет работодателя вводятся с 1 января 2019 г
			ДобавитьСведенияОНалогообложениеНачислений(Выборка.Начисление,ВидДохода,'20190101',Облагается,Облагается,Облагается,Облагается,Облагается, Облагается, Облагается);
			
			Если ИспользуетсяЕП 
				И ВидДохода = Справочники.ВидыДоходов.ДоходыОтРаботодателя Тогда
				// ЕП вводятся с 1 января 2023 г
				ДобавитьСведенияОНалогообложениеНачислений(Выборка.Начисление,ВидДохода,'20230101',Облагается,Облагается,Облагается,Облагается,Облагается, Облагается, Облагается,,,,,,,, Облагается);
			КонецЕсли;
			
			// ОПВР вводятся с 1 января 2024 г
			ДобавитьСведенияОНалогообложениеНачислений(Выборка.Начисление, ВидДохода, '20240101', Облагается, Облагается, Облагается, Облагается, Облагается, Облагается, Облагается,,,,,,,, Облагается,, Облагается);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ДобавитьСведенияОНалогообложениеНачислений(Начисление,
													ВидДохода,
													Период,
													СпособОбложенияИПН,
													СпособОбложенияОПВ,
													СпособОбложенияСН,
													СпособОбложенияСО,
													СпособОбложенияОППВ,
													СпособОбложенияВОСМС,
													СпособОбложенияООСМС,
													ДоходНеПодлежащийНалогообложениюИПН = Неопределено,
													ДоходНеПодлежащийНалогообложениюОПВ = Неопределено,
													ДоходНеПодлежащийНалогообложениюСН = Неопределено,
													ДоходНеПодлежащийНалогообложениюСО = Неопределено,
													ДоходНеПодлежащийНалогообложениюОППВ = Неопределено,
													ДоходНеПодлежащийНалогообложениюВОСМС = Неопределено,
													ДоходНеПодлежащийНалогообложениюООСМС = Неопределено,
													СпособОбложенияЕП = Неопределено,
													ДоходНеПодлежащийНалогообложениюЕП = Неопределено,
													СпособОбложенияОПВР = Неопределено,
													ДоходНеПодлежащийНалогообложениюОПВР = Неопределено) Экспорт
	
	МенеджерЗаписи = РегистрыСведений.НалогообложениеНачислений.СоздатьМенеджерЗаписи();
	
	МенеджерЗаписи.Начисление 							= Начисление; 
	МенеджерЗаписи.ВидДохода 							= ВидДохода;
	МенеджерЗаписи.Период 								= Период;
	МенеджерЗаписи.СпособОбложенияИПН 					= СпособОбложенияИПН;
	МенеджерЗаписи.СпособОбложенияОПВ					= СпособОбложенияОПВ;
	МенеджерЗаписи.СпособОбложенияСН 					= СпособОбложенияСН;
	МенеджерЗаписи.СпособОбложенияСО 					= СпособОбложенияСО;
	МенеджерЗаписи.СпособОбложенияОППВ 					= СпособОбложенияОППВ;
	МенеджерЗаписи.СпособОбложенияВОСМС 				= СпособОбложенияВОСМС;
	МенеджерЗаписи.СпособОбложенияООСМС 				= СпособОбложенияООСМС;
	МенеджерЗаписи.СпособОбложенияЕП 					= СпособОбложенияЕП;
	МенеджерЗаписи.СпособОбложенияОПВР 					= СпособОбложенияОПВР;
	МенеджерЗаписи.ДоходНеПодлежащийНалогообложениюИПН 	= ДоходНеПодлежащийНалогообложениюИПН;
	МенеджерЗаписи.ДоходНеПодлежащийНалогообложениюОПВ 	= ДоходНеПодлежащийНалогообложениюОПВ;
	МенеджерЗаписи.ДоходНеПодлежащийНалогообложениюСН 	= ДоходНеПодлежащийНалогообложениюСН;
	МенеджерЗаписи.ДоходНеПодлежащийНалогообложениюСО 	= ДоходНеПодлежащийНалогообложениюСО;
	МенеджерЗаписи.ДоходНеПодлежащийНалогообложениюОППВ = ДоходНеПодлежащийНалогообложениюОППВ;
	МенеджерЗаписи.ДоходНеПодлежащийНалогообложениюВОСМС = ДоходНеПодлежащийНалогообложениюВОСМС;
	МенеджерЗаписи.ДоходНеПодлежащийНалогообложениюООСМС = ДоходНеПодлежащийНалогообложениюООСМС;
	МенеджерЗаписи.ДоходНеПодлежащийНалогообложениюЕП   = ДоходНеПодлежащийНалогообложениюЕП;
	МенеджерЗаписи.ДоходНеПодлежащийНалогообложениюОПВР  = ДоходНеПодлежащийНалогообложениюОПВР;

	МенеджерЗаписи.Записать();

КонецПроцедуры	

Процедура ЗаполнитьНалогообложениеНачисленийПоКатегориям20240101() Экспорт
	
	ВидДохода 			= ПредопределенноеЗначение("Справочник.ВидыДоходов.ДоходыОтРаботодателя"); 
	Облагается 			= ПредопределенноеЗначение("Перечисление.СпособыНалогообложенияДоходов.ОблагаетсяЦеликом");
	НеОблагается 		= ПредопределенноеЗначение("Перечисление.СпособыНалогообложенияДоходов.НеОблагаетсяЦеликом");
	НеОблагаетсяЧатично = ПредопределенноеЗначение("Перечисление.СпособыНалогообложенияДоходов.НеОблагаетсяЧастично");
	
	ДоходНеПодлежащийНалогообложениюМатериальнаяПомощь = НСтр("ru = 'Пп. 18 п. 1 ст. 341 (выплаты для оплаты медицинских услуг, при рождении ребенка, на погребение)'"); 
	ДоходНеПодлежащийНалогообложению = Справочники.ДоходыНеПодлежащиеНалогообложениюЧастично.НайтиПоНаименованию(ДоходНеПодлежащийНалогообложениюМатериальнаяПомощь);
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Период", Дата('20240101')); 
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Начисления.Ссылка КАК Начисление,
	|	Начисления.Наименование КАК Наименование,
	|	Начисления.КатегорияНачисленияИлиНеоплаченногоВремени КАК КатегорияНачисленияИлиНеоплаченногоВремени,
	|	ЕСТЬNULL(НалогообложениеНачисленийСрезПоследних.ВидДохода, ЗНАЧЕНИЕ(Справочник.ВидыДоходов.ДоходыОтРаботодателя)) КАК ВидДохода,
	|	НалогообложениеНачисленийСрезПоследних.СпособОбложенияИПН,
	|	НалогообложениеНачисленийСрезПоследних.ДоходНеПодлежащийНалогообложениюИПН,
	|	НалогообложениеНачисленийСрезПоследних.СпособОбложенияОПВ,
	|	НалогообложениеНачисленийСрезПоследних.ДоходНеПодлежащийНалогообложениюОПВ,
	|	НалогообложениеНачисленийСрезПоследних.СпособОбложенияСН,
	|	НалогообложениеНачисленийСрезПоследних.ДоходНеПодлежащийНалогообложениюСН,
	|	НалогообложениеНачисленийСрезПоследних.СпособОбложенияСО,
	|	НалогообложениеНачисленийСрезПоследних.ДоходНеПодлежащийНалогообложениюСО,
	|	НалогообложениеНачисленийСрезПоследних.СпособОбложенияОППВ,
	|	НалогообложениеНачисленийСрезПоследних.ДоходНеПодлежащийНалогообложениюОППВ,
	|	НалогообложениеНачисленийСрезПоследних.СпособОбложенияВОСМС,
	|	НалогообложениеНачисленийСрезПоследних.ДоходНеПодлежащийНалогообложениюВОСМС,
	|	НалогообложениеНачисленийСрезПоследних.СпособОбложенияООСМС,
	|	НалогообложениеНачисленийСрезПоследних.ДоходНеПодлежащийНалогообложениюООСМС,
	|	НалогообложениеНачисленийСрезПоследних.СпособОбложенияЕП,
	|	НалогообложениеНачисленийСрезПоследних.ДоходНеПодлежащийНалогообложениюЕП
	|ИЗ
	|	ПланВидовРасчета.Начисления КАК Начисления
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НалогообложениеНачислений.СрезПоследних(&Период, ) КАК НалогообложениеНачисленийСрезПоследних
	|		ПО НалогообложениеНачисленийСрезПоследних.Начисление = Начисления.Ссылка
	|ГДЕ
	|	НЕ Начисления.КатегорияНачисленияИлиНеоплаченногоВремени = ЗНАЧЕНИЕ(Перечисление.КатегорииНачисленийИНеоплаченногоВремени.ОплатаПоДоговорамПодряда)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.КатегорияНачисленияИлиНеоплаченногоВремени = Перечисления.КатегорииНачисленийИНеоплаченногоВремени.ОтпускПоБеременностиИРодамБезОплаты
			ИЛИ Выборка.КатегорияНачисленияИлиНеоплаченногоВремени = Перечисления.КатегорииНачисленийИНеоплаченногоВремени.ПособиеПоУходуЗаРебенкомДоТрехЛет
			ИЛИ Выборка.КатегорияНачисленияИлиНеоплаченногоВремени = Перечисления.КатегорииНачисленийИНеоплаченногоВремени.Прогул                                   
			ИЛИ Выборка.КатегорияНачисленияИлиНеоплаченногоВремени = Перечисления.КатегорииНачисленийИНеоплаченногоВремени.НеявкаПоНевыясненнымПричинам
			ИЛИ Выборка.КатегорияНачисленияИлиНеоплаченногоВремени = Перечисления.КатегорииНачисленийИНеоплаченногоВремени.ОтпускБезОплаты
			ИЛИ Выборка.КатегорияНачисленияИлиНеоплаченногоВремени = Перечисления.КатегорииНачисленийИНеоплаченногоВремени.Отгул
			ИЛИ Выборка.КатегорияНачисленияИлиНеоплаченногоВремени = Перечисления.КатегорииНачисленийИНеоплаченногоВремени.ПростойПоВинеРаботника 
			ИЛИ Выборка.КатегорияНачисленияИлиНеоплаченногоВремени = Перечисления.КатегорииНачисленийИНеоплаченногоВремени.ОплатаПредыдущимиДокументами	Тогда
			
			// ОПВР вводятся с 1 января 2024 г
			ДобавитьСведенияОНалогообложениеНачислений(Выборка.Начисление, ВидДохода, '20240101', Выборка.СпособОбложенияИПН, 
																								  Выборка.СпособОбложенияОПВ, 
																								  Выборка.СпособОбложенияСН, 
																								  Выборка.СпособОбложенияСО, 
																								  Выборка.СпособОбложенияОППВ, 
																								  Выборка.СпособОбложенияВОСМС,
																								  Выборка.СпособОбложенияООСМС, 
																								  Выборка.ДоходНеПодлежащийНалогообложениюИПН, 
																								  Выборка.ДоходНеПодлежащийНалогообложениюОПВ,
																								  Выборка.ДоходНеПодлежащийНалогообложениюСН,
																								  Выборка.ДоходНеПодлежащийНалогообложениюСО,
																								  Выборка.ДоходНеПодлежащийНалогообложениюОППВ,
																								  Выборка.ДоходНеПодлежащийНалогообложениюВОСМС,
																								  Выборка.ДоходНеПодлежащийНалогообложениюООСМС,
																								  Выборка.СпособОбложенияЕП,
																								  Выборка.ДоходНеПодлежащийНалогообложениюЕП, 
																								  НеОблагается);
			
		ИначеЕсли Выборка.КатегорияНачисленияИлиНеоплаченногоВремени = Перечисления.КатегорииНачисленийИНеоплаченногоВремени.КомпенсацияОтпуска
			ИЛИ Выборка.КатегорияНачисленияИлиНеоплаченногоВремени = Перечисления.КатегорииНачисленийИНеоплаченногоВремени.ВыходноеПособие Тогда 
			
			// ОПВР вводятся с 1 января 2024 г
			ДобавитьСведенияОНалогообложениеНачислений(Выборка.Начисление, ВидДохода, '20240101', Выборка.СпособОбложенияИПН, 
																								  Выборка.СпособОбложенияОПВ, 
																								  Выборка.СпособОбложенияСН, 
																								  Выборка.СпособОбложенияСО, 
																								  Выборка.СпособОбложенияОППВ, 
																								  Выборка.СпособОбложенияВОСМС,
																								  Выборка.СпособОбложенияООСМС, 
																								  Выборка.ДоходНеПодлежащийНалогообложениюИПН, 
																								  Выборка.ДоходНеПодлежащийНалогообложениюОПВ,
																								  Выборка.ДоходНеПодлежащийНалогообложениюСН,
																								  Выборка.ДоходНеПодлежащийНалогообложениюСО,
																								  Выборка.ДоходНеПодлежащийНалогообложениюОППВ,
																								  Выборка.ДоходНеПодлежащийНалогообложениюВОСМС,
																								  Выборка.ДоходНеПодлежащийНалогообложениюООСМС,
																								  Выборка.СпособОбложенияЕП,
																								  Выборка.ДоходНеПодлежащийНалогообложениюЕП,
																								  Облагается);
			
		ИначеЕсли Выборка.КатегорияНачисленияИлиНеоплаченногоВремени = Перечисления.КатегорииНачисленийИНеоплаченногоВремени.МатериальнаяПомощь Тогда
			
			// ОПВР вводятся с 1 января 2024 г
			ДобавитьСведенияОНалогообложениеНачислений(Выборка.Начисление, ВидДохода, '20240101', Выборка.СпособОбложенияИПН, 
																								  Выборка.СпособОбложенияОПВ, 
																								  Выборка.СпособОбложенияСН, 
																								  Выборка.СпособОбложенияСО, 
																								  Выборка.СпособОбложенияОППВ, 
																								  Выборка.СпособОбложенияВОСМС,
																								  Выборка.СпособОбложенияООСМС, 
																								  Выборка.ДоходНеПодлежащийНалогообложениюИПН, 
																								  Выборка.ДоходНеПодлежащийНалогообложениюОПВ,
																								  Выборка.ДоходНеПодлежащийНалогообложениюСН,
																								  Выборка.ДоходНеПодлежащийНалогообложениюСО,
																								  Выборка.ДоходНеПодлежащийНалогообложениюОППВ,
																								  Выборка.ДоходНеПодлежащийНалогообложениюВОСМС,
																								  Выборка.ДоходНеПодлежащийНалогообложениюООСМС,
																								  Выборка.СпособОбложенияЕП,
																								  Выборка.ДоходНеПодлежащийНалогообложениюЕП, 
																								  НеОблагаетсяЧатично, 
																								  ДоходНеПодлежащийНалогообложению);
														
		ИначеЕсли Выборка.ВидДохода = Справочники.ВидыДоходов.ДоходыОтРаботодателя Тогда
			
			// ОПВР вводятся с 1 января 2024 г
			ДобавитьСведенияОНалогообложениеНачислений(Выборка.Начисление, ВидДохода, '20240101', Выборка.СпособОбложенияИПН, 
																								  Выборка.СпособОбложенияОПВ, 
																								  Выборка.СпособОбложенияСН, 
																								  Выборка.СпособОбложенияСО, 
																								  Выборка.СпособОбложенияОППВ, 
																								  Выборка.СпособОбложенияВОСМС,
																								  Выборка.СпособОбложенияООСМС, 
																								  Выборка.ДоходНеПодлежащийНалогообложениюИПН, 
																								  Выборка.ДоходНеПодлежащийНалогообложениюОПВ,
																								  Выборка.ДоходНеПодлежащийНалогообложениюСН,
																								  Выборка.ДоходНеПодлежащийНалогообложениюСО,
																								  Выборка.ДоходНеПодлежащийНалогообложениюОППВ,
																								  Выборка.ДоходНеПодлежащийНалогообложениюВОСМС,
																								  Выборка.ДоходНеПодлежащийНалогообложениюООСМС,
																								  Выборка.СпособОбложенияЕП,
																								  Выборка.ДоходНеПодлежащийНалогообложениюЕП,
																								  Облагается);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВидыПрочихДоходовФизическихЛиц.Ссылка КАК ВидПрочегоДохода,
	|	НалогообложениеНачисленийСрезПоследних.СпособОбложенияИПН,
	|	НалогообложениеНачисленийСрезПоследних.ДоходНеПодлежащийНалогообложениюИПН,
	|	НалогообложениеНачисленийСрезПоследних.СпособОбложенияОПВ,
	|	НалогообложениеНачисленийСрезПоследних.ДоходНеПодлежащийНалогообложениюОПВ,
	|	НалогообложениеНачисленийСрезПоследних.СпособОбложенияСН,
	|	НалогообложениеНачисленийСрезПоследних.ДоходНеПодлежащийНалогообложениюСН,
	|	НалогообложениеНачисленийСрезПоследних.СпособОбложенияСО,
	|	НалогообложениеНачисленийСрезПоследних.ДоходНеПодлежащийНалогообложениюСО,
	|	НалогообложениеНачисленийСрезПоследних.СпособОбложенияОППВ,
	|	НалогообложениеНачисленийСрезПоследних.ДоходНеПодлежащийНалогообложениюОППВ,
	|	НалогообложениеНачисленийСрезПоследних.СпособОбложенияВОСМС,
	|	НалогообложениеНачисленийСрезПоследних.ДоходНеПодлежащийНалогообложениюВОСМС,
	|	НалогообложениеНачисленийСрезПоследних.СпособОбложенияООСМС,
	|	НалогообложениеНачисленийСрезПоследних.ДоходНеПодлежащийНалогообложениюООСМС,
	|	НалогообложениеНачисленийСрезПоследних.СпособОбложенияЕП,
	|	НалогообложениеНачисленийСрезПоследних.ДоходНеПодлежащийНалогообложениюЕП
	|ИЗ
	|	Справочник.ВидыПрочихДоходовФизическихЛиц КАК ВидыПрочихДоходовФизическихЛиц
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.НалогообложениеНачислений.СрезПоследних(&Период, ) КАК НалогообложениеНачисленийСрезПоследних
	|		ПО НалогообложениеНачисленийСрезПоследних.Начисление = ВидыПрочихДоходовФизическихЛиц.Ссылка
	|			И (НалогообложениеНачисленийСрезПоследних.ВидДохода = ЗНАЧЕНИЕ(Справочник.ВидыДоходов.ДоходСубъектаПредпринимательства))";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		// ОПВР вводятся с 1 января 2024 г
		ДобавитьСведенияОНалогообложениеНачислений(Выборка.ВидПрочегоДохода, Справочники.ВидыДоходов.ДоходСубъектаПредпринимательства, '20240101', Выборка.СпособОбложенияИПН, 
													  Выборка.СпособОбложенияОПВ, 
													  Выборка.СпособОбложенияСН, 
													  Выборка.СпособОбложенияСО, 
													  Выборка.СпособОбложенияОППВ, 
													  Выборка.СпособОбложенияВОСМС,
													  Выборка.СпособОбложенияООСМС, 
													  Выборка.ДоходНеПодлежащийНалогообложениюИПН, 
													  Выборка.ДоходНеПодлежащийНалогообложениюОПВ,
													  Выборка.ДоходНеПодлежащийНалогообложениюСН,
													  Выборка.ДоходНеПодлежащийНалогообложениюСО,
													  Выборка.ДоходНеПодлежащийНалогообложениюОППВ,
													  Выборка.ДоходНеПодлежащийНалогообложениюВОСМС,
													  Выборка.ДоходНеПодлежащийНалогообложениюООСМС,
													  Выборка.СпособОбложенияЕП,
													  Выборка.ДоходНеПодлежащийНалогообложениюЕП, 
													  Облагается);
		
	КонецЦикла;

КонецПроцедуры

Процедура ЗаполнитьНалогообложениеНачисленийПоКатегориям20250101() Экспорт
	
	ВидДохода	= ПредопределенноеЗначение("Справочник.ВидыДоходов.ДоходыОтНалоговогоАгента"); 
	Облагается	= ПредопределенноеЗначение("Перечисление.СпособыНалогообложенияДоходов.ОблагаетсяЦеликом");
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Период", Дата('20250101')); 
	Запрос.УстановитьПараметр("ВидДохода", ВидДохода); 
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НалогообложениеНачислений.Начисление КАК Начисление
	|ИЗ
	|	РегистрСведений.НалогообложениеНачислений.СрезПоследних(&Период, ) КАК НалогообложениеНачислений
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НалогообложениеНачислений КАК НалогообложениеНачисленийПроверка
	|		ПО НалогообложениеНачислений.Период = НалогообложениеНачисленийПроверка.Период
	|			И (НалогообложениеНачисленийПроверка.Период = ДАТАВРЕМЯ(2025, 1, 1))
	|			И НалогообложениеНачислений.Начисление = НалогообложениеНачисленийПроверка.Начисление
	|ГДЕ
	|	НалогообложениеНачислений.ВидДохода = &ВидДохода
	|	И НалогообложениеНачисленийПроверка.Начисление ЕСТЬ NULL";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
			// СО по доховорам ГПХ отменены с 1 января 2025 г
			ДобавитьСведенияОНалогообложениеНачислений(Выборка.Начисление,
						ПредопределенноеЗначение("Справочник.ВидыДоходов.ДоходыОтНалоговогоАгента"),
						'20250101',
						Облагается, Облагается,, Облагается, Неопределено, Облагается, Неопределено);
		
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#КонецЕсли
